In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'col1':[1,2,3,4], 
                   'col2':[444,555,777,444], 
                   'col3' : ['abc', 'def', 'ghi', 'xyz']})

In [3]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   777  ghi
3     4   444  xyz

In [4]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   777  ghi
3     4   444  xyz

In [5]:
df['col2'].unique()  #output is an array of the unique values

array([444, 555, 777], dtype=int64)

In [6]:
len(df['col2'].unique())  #if i just want the number of unique values

3

In [8]:
df['col2'].nunique() #built in method to get the number of unique values

3

In [10]:
df['col2'].value_counts() #output is a series of each value any how many times it occurs

444    2
555    1
777    1
Name: col2, dtype: int64

In [11]:
def times2(x):
    return x*2

In [13]:
df['col1'].sum() #using a built in function on a column

10

In [14]:
#apply a custom function

df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [21]:
df['col3'].apply(len)  #apply function applies the function to each row

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [22]:
#apply() is often used with lambda expressions

In [27]:
df['col1'].apply(lambda x: x*2)  #now i can see where lambda is useful
                                 #dont need to define a function and then pass it in

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [33]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   777  ghi
3     4   444  xyz

In [43]:
df.drop('col1', axis = 1)

   col2 col3
0   444  abc
1   555  def
2   777  ghi
3   444  xyz

In [36]:
df.columns  #attribute

Index(['col1', 'col2', 'col3'], dtype='object')

In [38]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [39]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   777  ghi
3     4   444  xyz

In [46]:
df.sort_values(by = 'col2') #note how the index stays attached to the row

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   777  ghi

In [47]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [48]:
df.isna()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [52]:
data = {'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
       'B': ['one', 'one', 'two', 'tow', 'one', 'one'],
        'C': ['x','y','x','y','x','y'],
       'D': [1,3,2,5,4,1]}

In [61]:
df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  tow  y  5
4  bar  one  x  4
5  bar  one  y  1

In [62]:
df.pivot_table(values = 'D', index = ['A','B'], columns = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    tow  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN